import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# ====== CSVファイルの作成 ======
with open("c://cit-python//inputdata.csv", "w", encoding="utf-8") as f:
	data = """年月日時,気温,降水量(mm),風速(m/s),相対湿度(％)
2025/10/1 1:00,19.7,0,0.7,93
2025/10/1 2:00,19.9,0,0.5,91
2025/10/1 3:00,20.3,0,1.6,88
2025/10/1 4:00,20.4,0,0.7,89
2025/10/1 5:00,20,0.5,1.9,93
2025/10/1 6:00,19.8,0.5,0.8,96
2025/10/1 7:00,20.1,1,1.5,96
2025/10/1 8:00,20.6,0.5,1.4,95
2025/10/1 9:00,21.4,0,0.8,91
2025/10/1 10:00,21.7,0,0.9,89
2025/10/1 11:00,22.4,0,2.2,88
2025/10/1 12:00,21.9,0,1.8,90
2025/10/1 13:00,21.3,0,2.2,90
2025/10/1 14:00,20.7,0,2.4,91
2025/10/1 15:00,20.9,0,1.7,89
2025/10/1 16:00,20.5,0,1.7,88
2025/10/1 17:00,19.8,0,1.2,93
2025/10/1 18:00,19.1,0.5,1.4,95
2025/10/1 19:00,18.8,1,0.9,96
2025/10/1 20:00,18.7,0,0.4,97
2025/10/1 21:00,18.4,0,0.8,97
2025/10/1 22:00,18.3,0,0.8,97
2025/10/1 23:00,17.8,0,0.6,98
"""
	f.write(data)

# ====== 摂氏→ケルビン変換関数 ======
def conv_C_to_K(row):
	return row['気温'] + 273.15

# ====== メイン処理 ======
def main():
	file = "c://cit-python/inputdata.csv"
	df = pd.read_csv(file, encoding="utf-8", index_col=0)

	# 新しい列を追加
	df["K"] = df.apply(conv_C_to_K, axis=1)
	pd.set_option("display.max_columns", None)
	print(df.head(10))

	# ====== グラフ表示 ======
	sns.set_theme(style="whitegrid", context="talk", font="Meiryo")
	df.plot(y="気温", title="時間ごとの気温")
	plt.ylabel("気温 (℃)")
	plt.xlabel("年月日時")
	plt.show()

if __name__ == "__main__":
	main()
